---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.Equals(System.Object)
source: html/9b7669ae-794e-6a9e-29d9-e4ffbbbc6a22.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.